import sqlite3

def insert_data():
    recipes_data = [
        ('كشري مصري', 'أرز, مكرونة, عدس, بصل, طماطم, ثوم, خل, زيت', 
         '1. قم بسلق العدس والمكرونة. 2. في مقلاة، اقلي البصل حتى يصبح ذهبي اللون. 3. ضع الأرز في قدر مع ماء وملح واطبخه حتى ينضج. 4. في وعاء آخر، سخن زيت وضع الثوم والطماطم المفرومة حتى تصبح الصلصة جاهزة. 5. امزج جميع المكونات في طبق واحد. 6. قدّم مع الخل والبصل المقلي.',
         'chef-main\chef-main\static\uploads\كشري.jpg', 0.95),
        
        ('فتة شامية', 'خُبز, لبن, زبادي, ثوم, طحينة, زيت, لحم', 
         '1. قطع الخُبز إلى قطع صغيرة وضعها في وعاء. 2. امزج اللبن والزبادي في وعاء آخر وأضف الثوم المهروس. 3. ضع الطحينة في وعاء آخر مع قليل من الزيت وأخلطهم جيدًا. 4. اطبخ اللحم مع بعض البهارات ثم ضعه على الخُبز. 5. في النهاية، صب اللبن فوق الخُبز واللحم.',
         'chef-main\chef-main\static\uploads\images.jpg', 0.90),
        
        ('منسف أردني', 'لحم, أرز, لبن, جوز هند, صنوبر, بهارات', 
         '1. قم بسلق اللحم مع البهارات حتى يصبح طريًا. 2. في قدر آخر، اطبخ الأرز بالطريقة المعتادة. 3. حضر اللبن وأضف إليه بعض الجوز الهند. 4. قدم الأرز مع اللحم وصب اللبن فوقه وزينه بالصنوبر.',
         'chef-main\chef-main\static\uploads\منسف.jpg', 0.92),
        
        ('شاورما دجاج', 'دجاج, خبز, طحينة, ثوم, طماطم, خيار, ليمون', 
         '1. قم بتتبيل الدجاج بالثوم والليمون والبهارات ثم اشويه. 2. قطع الخبز إلى شرائح صغيرة. 3. ضع الطحينة على الخبز وأضف الخضروات المقطعة. 4. ضع الدجاج المشوي فوق الخبز وقدمها.',
         'chef-main\chef-main\static\uploads\شاورما.jpg', 0.88),
        
        ('محشي ورق عنب', 'ورق عنب, أرز, لحم, طماطم, بصل, عصير ليمون', 
         '1. قم بحشو ورق العنب بالأرز واللحم المفروم. 2. في قدر، ضع طبقة من ورق العنب المحشو. 3. أضف الطماطم والبصل وأضف الماء واتركها على النار حتى تنضج.',
         'chef-main\chef-main\static\uploads\ورق عنب.jpg', 0.85)
    ]
    
    conn = sqlite3.connect('recipes.db')
    c = conn.cursor()
    
    # إضافة البيانات إلى الجدول
    for recipe in recipes_data:
        c.execute('''INSERT INTO recipes (title, ingredients, instructions, image, confidence) 
                     VALUES (?, ?, ?, ?, ?)''', recipe)
    
    conn.commit()
    conn.close()

# استدعاء الدالة لإضافة البيانات
insert_data()
